widgets/login/LoginWidget.php

    public function run()
    {
        $model = new LoginForm();
        $resultados=Resultados::find()->all();
---
SELECT * FROM `resultados`