views/registrar/index.php

SELECT `department_id`, `department` FROM `ubigeo` GROUP BY `department`
---
                        <label class="control-label" for="registrar-departamento">Departamento</label>
                        <select style="padding-bottom: 0px;padding-top: 0px;height: 30px;" id="registrar-departamento" class="form-control" name="Registrar[departamento]" onchange='departamento($(this).val())'>
                        <option value=""></option>
                        <?php foreach(Ubigeo::find()->select('department_id,department')->groupBy('department')->all() as $departamento){ ?>